For this week's practice problem, we will be leveraging pandas to perform some common filtering operations.

In [2]:
import pandas as pd

In [5]:
# here we build our test grades dataframe
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]
GradeList = zip(names,grades)
df = pd.DataFrame(data = GradeList,
 columns=['Names', 'Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

_Can you replace all the subzero grades
with a grade of zero?_

In [6]:
# we will borrow the logic from the book to implement this requirement:
# All grades below zero are replaced 
df.loc[(df['Grades'] <= 0,'Grades')] = 0

df

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     101

The -2 value in our dataframe was replaced with a zero, as required